nobmaste/QH_Learning_Resources/Module/DDS/AD9854/测试程序/STM32版本/AD9854正点原子/AD9854测试程序_正点原子F429/User/stm32f429_Winner/stm32f429_winner.h
//-----------------------------------------------------------------
// 程序描述:
//    	数据类型定义和GPIO操作定义头文件
// 作    者: 凌智电子
// 开始日期: 2018-08-04
// 完成日期: 2018-08-04
// 当前版本: V1.0
// 历史版本:
//   - V1.0: (2018-08-04)数据类型定义、GPIO操作定义和系统时钟设置定义
// 调试工具: 凌智STM32F429+CycloneIV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//
//-----------------------------------------------------------------
#ifndef _WINNER_H
#define _WINNER_H
#include "stm32f4xx.h"
//-----------------------------------------------------------------
// 定义一些常用的数据类型短关键字 
//-----------------------------------------------------------------
typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  
typedef const int16_t sc16;  
typedef const int8_t sc8;  

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  
typedef __I int16_t vsc16; 
typedef __I int8_t vsc8;   

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  
typedef const uint16_t uc16;  
typedef const uint8_t uc8; 

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  
typedef __I uint16_t vuc16; 
typedef __I uint8_t vuc8;  

//-----------------------------------------------------------------
// 位带操作,实现GPIO控制功能
//-----------------------------------------------------------------
#define BITBAND(addr, bitnum) ((addr & 0xF0000000)+0x2000000+((addr &0xFFFFF)<<5)+(bitnum<<2)) 
#define MEM_ADDR(addr)  *((volatile unsigned long  *)(addr)) 
#define BIT_ADDR(addr, bitnum)   MEM_ADDR(BITBAND(addr, bitnum)) 

#define GPIOA_ODR_Addr    (GPIOA_BASE+20) // 0x40020014
#define GPIOB_ODR_Addr    (GPIOB_BASE+20) // 0x40020414 
#define GPIOC_ODR_Addr    (GPIOC_BASE+20) // 0x40020814 
#define GPIOD_ODR_Addr    (GPIOD_BASE+20) // 0x40020C14 
#define GPIOE_ODR_Addr    (GPIOE_BASE+20) // 0x40021014 
#define GPIOF_ODR_Addr    (GPIOF_BASE+20) // 0x40021414    
#define GPIOG_ODR_Addr    (GPIOG_BASE+20) // 0x40021814   
#define GPIOH_ODR_Addr    (GPIOH_BASE+20) // 0x40021C14    
#define GPIOI_ODR_Addr    (GPIOI_BASE+20) // 0x40022014 
#define GPIOJ_ODR_ADDr    (GPIOJ_BASE+20) // 0x40022414
#define GPIOK_ODR_ADDr    (GPIOK_BASE+20) // 0x40022814

#define GPIOA_IDR_Addr    (GPIOA_BASE+16) // 0x40020010 
#define GPIOB_IDR_Addr    (GPIOB_BASE+16) // 0x40020410 
#define GPIOC_IDR_Addr    (GPIOC_BASE+16) // 0x40020810 
#define GPIOD_IDR_Addr    (GPIOD_BASE+16) // 0x40020C10 
#define GPIOE_IDR_Addr    (GPIOE_BASE+16) // 0x40021010 
#define GPIOF_IDR_Addr    (GPIOF_BASE+16) // 0x40021410 
#define GPIOG_IDR_Addr    (GPIOG_BASE+16) // 0x40021810 
#define GPIOH_IDR_Addr    (GPIOH_BASE+16) // 0x40021C10 
#define GPIOI_IDR_Addr    (GPIOI_BASE+16) // 0x40022010 
#define GPIOJ_IDR_Addr    (GPIOJ_BASE+16) // 0x40022410 
#define GPIOK_IDR_Addr    (GPIOK_BASE+16) // 0x40022810 

#define PAout(n)   BIT_ADDR(GPIOA_ODR_Addr,n)  // 输出 
#define PAin(n)    BIT_ADDR(GPIOA_IDR_Addr,n)  // 输入 

#define PBout(n)   BIT_ADDR(GPIOB_ODR_Addr,n)  // 输出 
#define PBin(n)    BIT_ADDR(GPIOB_IDR_Addr,n)  // 输入 

#define PCout(n)   BIT_ADDR(GPIOC_ODR_Addr,n)  // 输出 
#define PCin(n)    BIT_ADDR(GPIOC_IDR_Addr,n)  // 输入 

#define PDout(n)   BIT_ADDR(GPIOD_ODR_Addr,n)  // 输出 
#define PDin(n)    BIT_ADDR(GPIOD_IDR_Addr,n)  // 输入 

#define PEout(n)   BIT_ADDR(GPIOE_ODR_Addr,n)  // 输出 
#define PEin(n)    BIT_ADDR(GPIOE_IDR_Addr,n)  // 输入

#define PFout(n)   BIT_ADDR(GPIOF_ODR_Addr,n)  // 输出 
#define PFin(n)    BIT_ADDR(GPIOF_IDR_Addr,n)  // 输入

#define PGout(n)   BIT_ADDR(GPIOG_ODR_Addr,n)  // 输出 
#define PGin(n)    BIT_ADDR(GPIOG_IDR_Addr,n)  // 输入

#define PHout(n)   BIT_ADDR(GPIOH_ODR_Addr,n)  // 输出 
#define PHin(n)    BIT_ADDR(GPIOH_IDR_Addr,n)  // 输入

#define PIout(n)   BIT_ADDR(GPIOI_ODR_Addr,n)  // 输出 
#define PIin(n)    BIT_ADDR(GPIOI_IDR_Addr,n)  // 输入

#define PJout(n)   BIT_ADDR(GPIOJ_ODR_Addr,n)  // 输出 
#define PJin(n)    BIT_ADDR(GPIOJ_IDR_Addr,n)  // 输入

#define PKout(n)   BIT_ADDR(GPIOK_ODR_Addr,n)  // 输出 
#define PKin(n)    BIT_ADDR(GPIOK_IDR_Addr,n)  // 输入


//-----------------------------------------------------------------
// 位带操作,实现GPIO控制功能
//-----------------------------------------------------------------


//-----------------------------------------------------------------
// 外部函数声明
//-----------------------------------------------------------------
extern void SystemClock_Config(u32 plln,u32 pllm,u32 pllp,u32 pllq);// 时钟系统配置


#endif

//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
